{
  "dda47c7a-57fd-4c06-aafe-069d661bd208": "Classification - Internal \n\n Classification - Internal   \n\n                              as on 18.07.2025 \n\nPolicy for the issuance and conduct of credit cards  \n\nPreface  \n\nRBI had issued the Master Direction – Credit Card and Debit Card – Issuance and Conduct \nDirections, 2022 (Updated as on March 07, 2024) As per the directions, “Each card-issuer shall have \na well-documented Board approved policy for the issuance and conduct of credit cards. The Board \napproved policy shall be available on the website of the card-issuer”  \n\nIn accordance with the  RBI directions, the salient points  of the board approved policy are  being \ndisplayed in this document  \n\n1. Card Product Details  \n\nHDFC Bank launches different variants in the market from time to time. The variants are broadly classified",
  "3ad669b3-f96b-49c5-9d70-ecb6185b0207": "k launches different variants in the market from time to time. The variants are broadly classified \nas Classic, Premium & Co-Brand and Super Premium Cards.   HDFC Bank also provides an option to their \ncustomers to choose from multiple card networks at the time of issue and renewal namely Visa, Rupay, \nMasterCard and Diners Club International. \n\n•  All  HDFC  Bank  Credit  Cards  issued  are  Contactless  Cards  which  facilitate  fast,  convenient  & \nsecure payments. HDFC Bank Credit Cards support Tokenization which is a replacement of the \ncardholder’s Primary Account Number (16digit card number)with an alternate number, referred \nto as a token.  \n\n•  All HDFC Bank credit  card members can avail of up to 3 add-on cards where the limit on the \n\nprimary credit card is shared with the add-",
  "36588d54-47c6-493e-81f1-520ccc149bcc": "n avail of up to 3 add-on cards where the limit on the \n\nprimary credit card is shared with the add-on card holders  \n\n•  HDFC Bank card members are covered for lost card liability i.e., once a card member reports loss \nof card to HDFC Bank within 48 hours, the liability for any subsequent transaction on that card is \nnot on the card holder  \n\n•  Credit cards generally carry an accelerated Rewards/Cashback on spends, activation & milestone \nbenefits and other card offerings towards lounge access & fuel-surcharge waiver as decided by \nHDFC Bank from time to time  \n\n2. Product variants and benefits:   \n\n•  HDFC  Bank  may  issue  Credit  Cards/charge  cards  for  specific  uses  and  purpose  as  may  be \n\n• \n\n• \n\n• \n\npermitted under the applicable law and the RBI Directions.  \nThe Bank may",
  "a858d068-a0ab-4c34-b26f-219d7b7fe0af": "as  may  be \n\n• \n\n• \n\n• \n\npermitted under the applicable law and the RBI Directions.  \nThe Bank may issue any types of Credit Card to the customers as may be permissible under the \napplicable laws and RBI regulations in the form of physical and/or virtual.  \nThe  Bank  may  also  issue  add-on  cards  on  the  Primary  Credit  Cards  to  the  persons  having \npredefined relationship with the primary cardholder and identified by the principal cardholder \nwith the clear understanding that the liability will be that of the principal cardholder.  \nThe credit card variants issued by the Bank is generally classified under the four types of Credit \nCards:  \n\nClassification - Internal  \n\nClassification - Internal \n\n \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\fClassification - Internal \n\n Classification - Interna",
  "31e4621f-d37f-48cb-91d8-0c0398453793": "ion - Internal \n\n \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\fClassification - Internal \n\n Classification - Internal   \n\n                              as on 18.07.2025 \n\no  Credit Cards issued to individuals  \no  Business Credit Cards to entities including Charge cards  \no  Corporate Credit Cards; and  \no  Co-branded Credit Cards.  \n\n Standard Product Features   \n\nThe terms and conditions as well as the features of the credit cards issued by the Bank may vary from time to time. \nBank shall update the customers about the changes to the same in accordance with the timelines prescribed under \nthe Applicable Law, if any or else within a reasonable time period. The customer may please contact the Bank for \nfurther details. Issuance of credit cards is at the sole discretion of the bank  \n\nStandard Products",
  "03b301de-3408-43a7-af9a-23270da9b955": "her details. Issuance of credit cards is at the sole discretion of the bank  \n\nStandard Products  \n\nClassic, Premium & Co-Brand, Super Premium    \n\nPurpose of Facility  \n\nInterest  free  credit  facility  to  individuals  and  entities  up  to  a \nspecified limit and for a specified period of time  \n\nMinimum Credit limit  \n\nRs 10,000  \n\nMinimum Age  \n\n21 years  \n\nApplication form  \n\nDigital or Physical  \n\nInterest free credit period   \n\nUp to 55 days  \n\nEligible segments  \n\nRepayment   \n\nSecurity / Collateral  \n\nStatements and Payments  \n\nSalaried  or  Self-employed  individuals,  entities  or  Customer  who \nhave  existing  bank  relationship.  NRI’s,  PIO’s  &  Foreign  national’s \nresidents in India are eligible as per the credit norms applicable and \nsubject to adherence of FEMA, issue",
  "b061e988-3a6d-47f4-b85f-87e6dacab2b6": "ts in India are eligible as per the credit norms applicable and \nsubject to adherence of FEMA, issued by RBI from time to time.   \n\nThrough  any  of  the  payment  channels  (E.g.  Net  banking,  ATMs, \nCheque  /cash  deposit  in  branches,  Standing  instructions  for \naccount holders with HDFC Bank). For credit cards issued to NRIs / \nPIOs,  the  repayment  shall  be  as  per  the  defined  process  for  NRI \nsourcing and FEMA directions issued by RBI from time to time.     \n\nNo collateral required for regular Cards. There is a FD based card \nwhere the Credit card is issued with a lien marked against the Fixed \nDeposit  held  by  the  customer.  The  limit  shall  be  as  per  the \napplicable norms decided by the Bank from time to time.  \n\nCredit  card  statements  are  generated  as  pe",
  "ee5bc75d-4a98-482d-8f9e-21cc7e5ee457": "ble norms decided by the Bank from time to time.  \n\nCredit  card  statements  are  generated  as  per  the  respective  billing \ncycle  with  the  due  date  of  payment  mentioned  on  the  statement. \nCustomers are expected to make the minimum amount due as per \nthe  statement  or  an  amount  higher  than  the  minimum  amount \nsubject to total amount due as per the product construct. The billing \ncycle change requested by customer shall be guided by RBI’s extant \nnorms  as  amended  from  time  to  time.  Bank  provides  an option  to \ncustomers  to  change  their  billing  cycle  ‘at  least  once’  as  per  their \nconvenience. \n\nClassification - Internal  \n\nClassification - Internal \n\n \n  \n  \n  \n \n\fClassification - Internal \n\n Classification - Internal",
  "b16c424f-fe90-4e41-bd1c-56b1f0cbf913": "Classification - Internal \n\n Classification - Internal   \n\n                              as on 18.07.2025 \n\n2a. Classic Cards: These cards are issued with a minimum limit of Rs. 10,000. The interest rate is up to \n3.75%  per  month  (45%  per  annum) on  revolving  credit.  Of  the  overall  credit  limit,  up  to  40%  can  be \nutilized  as  cash.  The  products  offered  under  this  segment  include  Freedom,  MoneyBack+,  Business \nMoneyBack & Small Business MoneyBack & Digital UPI RuPay Credit Card & PIXEL Go under Classic Cards  \n\n2b. Premium & Cobrand Cards: These cards offer lifestyle benefits and carry interest rate for revolving \nbalances starting at 3.75% pm (45% per annum). The products under this category are Millennia and Co-\nbranded credit cards like “Indigo”, “",
  "4dcb286e-e538-4319-905d-d8e6426970c4": "annum). The products under this category are Millennia and Co-\nbranded credit cards like “Indigo”, “Inter-Miles”, “Times”, “IOCL” & “Best Price “ & PIXEL PLAY \n\n2c. Super Premium Cards: Products in this category cater to the Managed, High Networth  \nIndividuals  &  Ultra  HNI.  The  products  offered  under  this  category  include:  Infinia,  Regalia,  Diners \nPrivilege, Diners Black, Doctor’s Regalia, and Business Regalia. \n\nVariant  \n\nCharges (excluding GST) \n\nMonthly (upto) \n\nAnnually (upto) \n\nInfinia, Infinia(metal edition), Diners Black Metal edition, \nDiners Black, BizBlack Metal Card, H.O.G Diners Club \n\n1.99% \n\n23.88% \n\nAll other variants \n\n3.75% \n\n45% \n\n2d. Co-brand Credit Cards- HDFC Bank Limited (“Bank) is partnering with companies across various \nindustries such as shopping, h",
  "e455e6cc-6d7b-4e17-912f-6666e50b8c39": "DFC Bank Limited (“Bank) is partnering with companies across various \nindustries such as shopping, healthcare and pharma, travel, fintech, merchant aggregators and banks in \norder to tap all customer segments, increase carding penetration and gain credit card market share \nacross both merchant and consumer segments. We have namely PayTM, Pharmeasy, Flipkart \nWholesale, Shoppers Stop, IRCTC Co-brand, Equitas Small Finance Bank, Marriott, Tata, Swiggy, \nPhonePe, GPay leading partners \no  HDFC Bank UPI Credit Card – In yet another first of HDFC Bank, for existing non -RuPay card customers \nof the bank (Visa, MasterCard, Diners) who wish to have a RuPay variant for linking to UPI, which is a \nvirtual card that existing card customers can apply easily through MyCards platform and also link to",
  "d8c47a42-b268-4587-8c1b-3aa8bf83e79c": "rtual card that existing card customers can apply easily through MyCards platform and also link to \nUPI PSP apps for making UPI spends at merchant locations. \n\no  Pixel Range of Credit Cards – HDFC Bank has launched one of a kind end to end digital credit card, \nwherein the card is completely managed within the app (currently PayZapp). Once approved, a digital \ncard is issued instantly and customers can view card details, manage card controls, view rewards and \ntransactions  and  even  raise  queries  all  within  the  app.  It  also  offers  a  unique  DIY  customization \nfeatures like choosing card design, billing cycle and choice of merchants for rewards etc. Currently \ntwo variants  namely Pixel Play  and Pixel  Go  are  launched  in  May’24  under  this  range.  The  card  is \ntargete",
  "fafa625b-f761-4afe-bede-69cb83a2395a": "ly Pixel Play  and Pixel  Go  are  launched  in  May’24  under  this  range.  The  card  is \ntargeted at tech-savvy , millennials and GenZ customers. \n\n2e. Corporate and Business cards program targets business spends related to travel, entertainment, \nvendor payments and other areas where card payments are accepted. The bank offers credit cards to \ncorporate entities in the form of Corporate and Business Cards.    \n\nClassification - Internal  \n\nClassification - Internal \n\n \n  \n  \n  \n\fClassification - Internal \n\n Classification - Internal   \n\n                              as on 18.07.2025 \n\n3. Issuance of Credit Cards  \n\n3.a Customer Acquisition  \n\n• \n\n• \n\n• \n\n• \n\n• \n\n• \n\n• \n\nThe Bank shall, in both physical as well as digital customer journeys, convey all information as \nis required to be",
  "6ffd7291-dbd8-4e3b-8055-0e9323c99964": "in both physical as well as digital customer journeys, convey all information as \nis required to be provided to an applicant at the time of issuance of a Credit Card, to maximize \ntransparency and customer convenience  \n\nThe  credit  cards  are  issued  by  the  Bank  at  the  sole  discretion  of  the  Bank  and  subject  to \nadherence of Credit norms and documentation requirements of the Bank.  \n\nThe  credit  limit  for  a  cardholder  shall  be  assessed  by  the  Bank  in  accordance  with  the \nunderwriting and Credit guidelines formulated by the Bank from time to time for underwriting \nof the prospective  customers  for issuance of Credit Cards. The final credit  limit  is assigned \nafter factoring in the existing loans and credit card obligations from the credit bureau record \nof th",
  "4e3b5a4f-b36d-4811-abb3-af11fd0018c0": "ter factoring in the existing loans and credit card obligations from the credit bureau record \nof the customer.  \n\nIn the corporate card program, corporate entities are appraised for credit worthiness and a \ncredit limit is approved based on the requirement of the corporate. Corporate underwriting \nwould be done on a CAM (Credit Approval Memo) based approach supported with assessment \nof financial statements of the corporate. Card limit will be a part of the overall CAM. Credit \nlimit  is  assessed  based  on  financial  statements  of  the  corporate  supported  with  other \ndocuments such as Annual Reports, Board resolution and Business vintage.   \nThe  Bank  shall  obtain  all  necessary  consents  required  from  the  customer  at  the  time  of \ncustomer onboarding.  \n\nThe terms and c",
  "95caeece-227d-4ce5-9350-f4e504863418": "consents  required  from  the  customer  at  the  time  of \ncustomer onboarding.  \n\nThe terms and conditions applicable to the Credit Cards including, without limitation, the most \nimportant  terms  and  conditions  (“MITC”),  Key  Fact  Statement  (KFS)  and  Card  Member \nAgreement (CMA) shall be communicated to the customer in a transparent manner and a copy \nof the same shall be provided to the cardholder as required under the RBI regulations, Master \nDirection – Credit Card and Debit Card – Issuance and Conduct Directions, 2022. \n\nIn case of rejection of a Credit Card application, the Bank shall convey the same along with the \nreason/s, in writing through physical letter or e-mail.  \n\nfurther  \n\nFor  \nhttps://www.hdfcbank.com/personal/pay/cards/credit-cards/membership-kit   \n\nwebsite",
  "2b7456c7-9902-4ca9-87b7-77328994371a": "further  \n\nFor  \nhttps://www.hdfcbank.com/personal/pay/cards/credit-cards/membership-kit   \n\nwebsite  \n\ndetails,  \n\nplease  \n\nvisit  \n\nour  \n\nwww.hdfcbank.com  \n\nor   \n\n3b. Bank’s KYC/AML/CFT policies  \n\nThe instructions/directions on KYC/AML/CFT issued by RBI from time to time and bank’s policy, shall be \nstrictly adhered to in respect of all cards issued by the Bank, including Co-Branded Credit Cards.  \n\n3c. Credit Card Charges & Terms   \n\nCharges, Terms & Conditions, Key Fact Statement and other relevant documents are available on the \nwebsite : https://www.hdfcbank.com/personal/pay/cards/credit-cards/membership-kit   \n\nFor more information, visit HDFC Bank Website.  \n\nMITC Path – Personal > Pay > Cards > Credit Cards> Key Fact Statement cum MITC OR  \nRefer to https://www.hdfcbank.com/p",
  "48a7f771-0a97-4dab-8b07-6b6513981834": "l > Pay > Cards > Credit Cards> Key Fact Statement cum MITC OR  \nRefer to https://www.hdfcbank.com/personal/pay/cards/credit-cards/membership-kit   \n\nClassification - Internal  \n\nClassification - Internal \n\n \n  \n  \n  \n  \n  \n  \n  \n\fClassification - Internal \n\n Classification - Internal   \n\n                              as on 18.07.2025 \n\n4. Customer Service & Grievance Redressal  \n\nGrievance redressal and escalation process. The cardholder shall be entitled to submit complaints \nor grievances arising in relation to the Credit Cards through the following touchpoints \nFirst level Touch-Points – Queries / Feedback / Complaints. The customer can reach out to the \nfollowing channels:   \n\n•  Online Dispute Resolution   \n•  Call us   \n•  Visit us   \n•  Write to us   \n• \nEmail us   \n•  Report unaut",
  "0d641f17-044b-4611-ae18-864990044d20": "Dispute Resolution   \n•  Call us   \n•  Visit us   \n•  Write to us   \n• \nEmail us   \n•  Report unauthorised e-transactions (Transactions not done by you)   \n•  Chat with us   \n•  Block / Unblock credit card   \n•  Check your credit card outstanding amount   \n•  Credit cards mis-selling or harassment related complaints  \n\nSecond level touch points:   \n\n• \nIf you have not received a satisfactory response for your queries with other channels. \nPlease write to Mrs. Deepa Balakrishnan (Grievance Redressal Officer+91 22 61606160The \nCardmember can contact HDFC Bank Credit Cards for making any enquiries or for any \ngrievance redressal through  \n•  Call Centres: 1800 1600 / 1800 2600 If you are not in India: +91 22 61606160 \n•  Post: Manager, HDFC Bank Cards, HDFC Bank Cards Division, PO Box No 865",
  "49413e58-1ecf-4c48-b38f-a6067c8809db": "n India: +91 22 61606160 \n•  Post: Manager, HDFC Bank Cards, HDFC Bank Cards Division, PO Box No 8654, Door \nNo 94 SP, Estate Bus Stand, Wavin Main Road, Mogappair West, Chennai 600058 \nEmail: customerservices.cards@hdfcbank.com   \n\n• \n•  Grievance Redressal Officer: Reach us on phone 04461084900 between 09.30 a.m. to \n05.30 p.m. Monday to Friday. The details of the Grievance Redressal Officer and  the \nmechanism and timelines of Grievance Redressal, is updated in the Grievance \nRedressal Policy. The Grievance Redressal Policy  is available on the website – \nwww.hdfcbank.com and the same can be accessed by following the path – Our \nCorporate Commitment -> Citizens Charter -> Grievance Redressal  \n\nFurther details are covered under : \nhttps://www.hdfcbank.com/personal/pay/cards/creditcards/",
  "c3501628-fec4-42bd-a6a3-c25e809ab740": "sal  \n\nFurther details are covered under : \nhttps://www.hdfcbank.com/personal/pay/cards/creditcards/membership-kit   \n\n• \n\nThe Cardmember can contact HDFC Bank Credit Cards for making any enquiries or for \nany grievance redressal through:  \n\n•  Call centres: : 1800 1600 / 1800 2600 If you are not in India: +91 22 61606160 \n• \n\nInfinia / Infinia (Metal Edition) / Diners Black Metal Edition/ Diners Black customers: \nPlease visit https://www.hdfcbank.com/Infinia for 24 hours dedicated customer care \nnumber   \n\n•  Marriott Bonvoy HDFC Bank Customers: 1800 309 3100 For dedicated concierge \n\nservices (9am – 9pm).   \n\nClassification - Internal  \n\nClassification - Internal \n\n \n  \n  \n  \n  \n  \n  \n  \n  \n\fClassification - Internal \n\n Classification - Internal   \n\n                              as on 18",
  "d30083ef-69ce-46ee-a031-891e39b487b5": "Classification - Internal \n\n Classification - Internal   \n\n                              as on 18.07.2025 \n\n•  Mail: Manager, HDFC Bank Cards, HDFC Bank Cards Division, PO Box No 8654, Door \nNo 94 SP, Estate Bus Stand, Wavin Main Road, Mogappair West, Chennai 600058 \nemail: customerservices.cards@hdfcbank.com   \n\n• \n•  Grievance Redressal Official: 044 6108 4900 between 09:30 AM to 05:30 PM Monday \n\nto Friday  \n\nIn the event that the cardholder’s grievanceis not resolved through the primary touchpoints \nwithin the stipulated TAT defined as per nature of complaints, and all other information \nrequired by the Bank or cardholder is not satisfied with the resolution by the redressal officer, it \ncan be escalated and reported by the cardholder to the grievance redressal cell of the bank. \nCu",
  "c631024a-75d9-4834-b3a3-7d60ba03b5e1": "it \ncan be escalated and reported by the cardholder to the grievance redressal cell of the bank. \nCustomer Compensation Policy is displayed on the bank website under Our Corporate \nCommitment > Citizens Charter > Customer Compensation Policy > Credit Cards \nFor any sales queries on mis-selling / harassment / complaints, please write to \nsalesqueriescards@hdfcbank.com or call at 18002583838 \nFor Credit Card services like Checking Your Reward Points/CashPoints, Converting Eligible Spends \nto EMI and Reporting Credit Card Disputes through SMS, please send an SMS to 7308080808. \nThere are no pre-defined keywords and you can type your own query to use this facility \nPHONEBANKING NUMBERS \n\n1800 1600 / 1800 2600 \n\nIf you are not in India: +91 22 61606160 \n\nFor more details, visit HDFC bank websit",
  "ca1ad39f-399d-4a72-8172-c723a9c43c31": "00 / 1800 2600 \n\nIf you are not in India: +91 22 61606160 \n\nFor more details, visit HDFC bank website, and follow the path.  \n\nHDFC Bank> Credit Cards > Manage Your Credit Card> Retail Card Member Agreement  \nOR  \nhttps://www.hdfcbank.com/personal/pay/cards/credit-cards/membership-kit   \n\n5. Definitions  \n\n“Business  Credit  Card(s)”  shall  mean  the  Credit  Card(s)  that \n\n• \nissued  to  business \nentities/individuals for the purpose of business expenses with specified terms and conditions and not for \npersonal use;  \n• \n“Corporate Credit Card(s)” shall mean the Credit Card(s) that is issued to specific employee/s of \na corporate employer wherein the liability could rest with the corporate entity or the employee or jointly \non both, as per the product design features;  \n\nis \n\n• \n“Credit",
  "c6afe5ea-a239-4d90-8e54-98b6943624b7": "e entity or the employee or jointly \non both, as per the product design features;  \n\nis \n\n• \n“Credit Card(s)” shall mean a physical or virtual payment instrument(s) containing a means of \nidentification, issued with a pre-approved revolving credit limit, that can be used to purchase goods and \nservices or draw cash advances, subject to prescribed terms and conditions;  \n\n“Charge Card” shall mean the credit card where the user has to pay the billed amount in full on \n\n• \ndue date after the billing cycle, and no rolling over of credit to the next billing cycle is permitted.   \n\nClassification - Internal  \n\nClassification - Internal",
  "d5d8242c-3c47-4759-b3f4-b9c85ced1058": "SBI Bank Policies \n\nQ. What are the current interest rates for SBI savings account on \ndeposits of Rs. 5 lakh? \n\nAns. The current rate of interest for SBI savings account on deposit of Rs. 5 lakh is 2.50% per \n\nannum. \n\nQ. Is there a minimum balance requirement for SBI savings account? \n\nAns. There is no minimum balance required for SBI savings account except for Savings Plus \n\nAccount where you need to maintain minimum MOD (Multi Option Deposit) of Rs. 35,000. \n\nQ. What is the Minimum Average Balance (MAB) or maximum balance \nrequired to maintain in an SBI savings account? \n\nAns. On March 11th, 2020, SBI announced a waiver of the average monthly balance. This \n\nmeans, no penalty is charged if the balance is brought to nil. Moreover, there is no maximum \n\nlimit to maintain in your SBI savi",
  "781a7f7d-d2de-4a75-bb60-2c642be772e8": "if the balance is brought to nil. Moreover, there is no maximum \n\nlimit to maintain in your SBI savings account. \n\nQ. Can minors open a savings account with SBI? \n\nAns. Yes, SBI provides Savings Account for Minors namely PehlaKadam and PehliUdaan. \n\nQ. What documents are required to open an SBI savings account for \nminors? \n\nAns. Documents required to open an SBI savings for minors is: \n\n•  PehlaKadam: Date of Birth proof of the minor + KYC of the parent \n\n•  PehliUdaan: Date of Birth proof of the minor + KYC of the parent \n\nQ. How can I open an SBI savings account online?   \n\nAns. To open an SBI savings account online, you will have to download YONO app from google \n\nplay store/app store and follow the steps as prompted. \n\nQ. Are there any charges for not maintaining the minimum balance i",
  "92a9f6a6-628f-41e5-a5c3-dc924ea93769": "d follow the steps as prompted. \n\nQ. Are there any charges for not maintaining the minimum balance in \nSBI savings account? \n\nAns. No, SBI doesn’t levy any charges for not maintaining the minimum balance in your SBI \n\nsavings account. \n\nQ. How can I access SBI’s online banking services? \n\n\fAns. To access SBI’s online banking services, you can either visit your SBI branch and register \n\nfor the internet banking services or download SBI YONO app and register yourself to use its \n\nservices. \n\nQ. What is the process to close an SBI savings account? \n\nAns. You will have to visit your bank’s branch for the account closure process. Fill out the \n\naccount closure form and submit it to close your account. \n\nQ. Can I open an SBI zero-balance savings account? \n\nAns. Yes. You can open SBI Basic Saving",
  "842672ec-136c-448e-8ac1-39d92209a2d4": "ount. \n\nQ. Can I open an SBI zero-balance savings account? \n\nAns. Yes. You can open SBI Basic Savings Bank Deposit Account at zero balance. \n\nQ. Is it possible to have more than one SBI savings account? \n\nAns. You can have different types of accounts in SBI (like savings, current, etc.) but with the \n\nsame customer ID. All the accounts will be interlinked. \n\nQ. How can I check my SBI savings account balance? \n\nAns. You can check your account balance by visiting your nearest ATM or bank branch and with \n\nthe help of bank’s net banking facility, by giving a missed call on 919223766666 or sending an \n\nSMS ‘MODBAL’ to 919223766666 from your registered mobile. Read More: SBI Balance \n\nEnquiry \n\n Q. Is overdraft facility available with SBI savings account? \n\nAns. Yes, SBI savings account is a se",
  "45fefa1f-4148-491f-a3ed-7d2b976bcd76": "Q. Is overdraft facility available with SBI savings account? \n\nAns. Yes, SBI savings account is a secure banking service that helps you gain interest on the \n\nmoney invested in the account. Whereas, Overdraft is a different banking facility that helps you \n\nborrow money in the form of a credit limit that can be repaid over a period of time. \n\nQ. How can I check my SBI account balance via SMS service? \n\nAns. For SBI balance enquiry, SMS “BAL” to 09223766666 from your registered mobile \n\nnumber. Click here to know how to get SBI mini-statement and more related to your SBI account. \n\nNote: This page may not contain the most up-to-date information. Please visit the bank’s official \n\nwebsite for the latest details. \n\nSBI Savings Account News \n\nSBI refunds charges deducted from basic savings ban",
  "070975fb-b651-4430-87a0-44c82d53d5d8": "the latest details. \n\nSBI Savings Account News \n\nSBI refunds charges deducted from basic savings bank accounts \n\n \n \n\fApril 15th 2021 \n\nSBI, on Thursday, clarifies that it has refunded the charges it recovered from Basic Savings Bank Deposit (BSBD) Accounts. \n\nCharges levied on transactions that took place between January 1 and September 14, 2020, have all been refunded, SBI claimed. \n\nAlso, the bank further clarified that it has stopped levying charges on digital transaction of all BSBD accounts. However, charges \n\nhave been retained on cash withdrawals post the fixed limit of 4 withdrawals in a month. \n\nFacility to open SBI savings account online relaunched \n\nJune 12th 2020 \n\nState Bank of India (SBI) has relaunched its online facility to open a savings account. Now customers can now use",
  "5a1d7bb2-bdbc-4d99-b5bf-ed591adaccc5": "India (SBI) has relaunched its online facility to open a savings account. Now customers can now use the bank’s \n\nmobile app, SBI YONO to open “SBI Insta Savings Bank Account”. \n\nCustomers only need to produce their PAN and Aadhaar number to open this account. They will be issued with an ATM-cum-debit \n\ncard for instant access to money. \n\nThe decision is in line with the need for social distancing in the current times of COVID-19. \n\nSBI waives Average Monthly Balance (AMB) \n\nMarch 12th 2020 \n\nSBI, the country’s largest bank, on Wednesday announced a waiver on maintaining the average minimum balance (AMB) \n\nrequirement for all savings bank accounts. \n\nCurrently, there is an AMB of ₹ 3,000, ₹ 2,000 and ₹ 1,000 in metro, semi-urban and rural areas, respectively. There was a penalty \n\nof ₹ 5 -",
  "98e83fc7-3422-40b7-afb0-101f66688b70": "2,000 and ₹ 1,000 in metro, semi-urban and rural areas, respectively. There was a penalty \n\nof ₹ 5 -15 +taxes on the non-maintenance of AMB. \n\nAlong with the AMB waiver, the bank has also waived off SMS charges. \n\nSBI changes Cash Deposit Rules for Savings Account \n\nSeptember 13, 2018 \nState Bank of India announced on Twitter has removed the upper limit on the amount which can be deposited in a savings account \n\nat a non-home branch. Earlier, the upper limit for cash deposit at the non-home branch was Rs. 25,000. SBI has also levied Rs. 50 \n\nplus GST per transaction on cash deposits at non-home branches, as listed on their website. For SME, the upper limit on cash \n\ndeposits at non-home branch remains unchanged at Rs. 2 lakhs per day.",
  "8349a9e8-dacb-4211-ad80-c00ef2eb0826": "ch remains unchanged at Rs. 2 lakhs per day."
}